In [1]:
import pandas as pd

In [2]:
고객=pd.read_excel("https://data.hossam.kr/customer.xlsx")
매출=pd.read_excel("https://data.hossam.kr/money.xlsx")

In [7]:
pd.merge(고객,매출,how="left") #outer,lefr,right,inner

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [9]:
df_left=pd.read_excel("https://data.hossam.kr/merge_left2.xlsx")
df_right=pd.read_excel('https://data.hossam.kr/merge_left2.xlsx')

In [12]:
print(df_left.dtypes ,df_right.dtypes)

고객명    object
날짜     object
데이터     int64
dtype: object 고객명    object
날짜     object
데이터     int64
dtype: object

In [13]:
pd.merge(df_left,df_right, on="고객명")

  고객명        날짜_x   데이터_x        날짜_y   데이터_y
0  민수  2018-01-01   20000  2018-01-01   20000
1  수영  2018-01-01  100000  2018-01-01  100000

In [17]:
df_right.rename(columns={"날짜" : "월일"},inplace=True)

In [19]:
pd.merge(df_left,df_right,left_on="날짜",right_on="월일")

  고객명_x          날짜   데이터_x 고객명_y          월일   데이터_y
0    민수  2018-01-01   20000    민수  2018-01-01   20000
1    민수  2018-01-01   20000    수영  2018-01-01  100000
2    수영  2018-01-01  100000    민수  2018-01-01   20000
3    수영  2018-01-01  100000    수영  2018-01-01  100000

#### 인덱스를 이용한 merge

In [23]:
l_data=pd.DataFrame({'국어':[80,90]}, index=["A","B"])

   국어
A  80
B  90

In [24]:
r_data=pd.DataFrame({"수학":[30,70]},index=["A","C"])

In [28]:
pd.merge(l_data,r_data, left_index=True, right_index=True)

   국어  수학
A  80  30

#### concat

In [32]:
pd.concat([l_data,r_data],ignore_index=True)

     국어    수학
0  80.0   NaN
1  90.0   NaN
2   NaN  30.0
3   NaN  70.0

#### pivot table

In [36]:
data = pd.read_excel("https://data.hossam.kr/city_people.xlsx")

In [37]:
display(data)

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [38]:
pd.pivot_table(
    data,
    index="연도",
    columns="도시",
    values="인구",
    aggfunc=["mean","median"]
)

           mean                           median
도시           부산         서울         인천         부산         서울         인천
연도
2005  3512547.0  9762546.0        NaN  3512547.0  9762546.0        NaN
2010  3393191.0  9631482.0  2632035.0  3393191.0  9631482.0  2632035.0
2015  3448737.0  9904312.0  2890451.0  3448737.0  9904312.0  2890451.0

In [39]:
pd.pivot_table(
    data,
    index=["지역","도시"],
    columns="연도",
    values="인구",
    aggfunc=["mean","median"]
)

             mean                           median
연도           2005       2010       2015       2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0  9762546.0  9631482.0  9904312.0
    인천        NaN  2632035.0  2890451.0        NaN  2632035.0  2890451.0

#### 교차표(crosstab)

In [40]:
data=pd.read_excel("https://data.hossam.kr/score.xlsx")

In [46]:
pd.crosstab(index=data["score"],
            columns=data["gender"],
            margins=True)
#margin : 총계 표시

gender  M  W  All
score
A       1  1    2
B       2  1    3
C       1  2    3
All     4  4    8

In [48]:
pd.crosstab(index=data["score"],
            columns=data["gender"],
            margins=True,
            normalize=True)
#normalize : 비율

gender      M      W    All
score
A       0.125  0.125  0.250
B       0.250  0.125  0.375
C       0.125  0.250  0.375
All     0.500  0.500  1.000